## Assignment 2 - Group 1 

First of all, we import the libraries to be used in this work:

In [1]:
import numpy as np
import pandas as pd

#### Question 1.2 - Lists

Let the following data be provided by the problem:

In [2]:
f_list = [np.nan , np.nan, "Austria", "Germany", np.nan, "Pakistan", "np.nan", np.nan ]
text1 = ['My', 'teacher', 'assistant', 'is', 'so', 'boring.']
p2_list = [ 2 , 3, 4, 5 ]
values1 = [ 86, 86, 85, 85, 85, 83, 23, 0, 84, 1 ] 
last_and_name = [ "CORNEJO SANCHEZ, CHRISTIAN SANTOS", "ORELLANA QUISPE, CRISTIAN NASSER", "MORALES CHOQUEHUANCA, ANGELICA KARINA", "GUIMARAY RIBEYRO, JOSE ROBERTO", "CAMACHO GAVIDIA, ABEL FERNANDO", "TINTAYA ORIHUELA, MEIR ALVARO", "CHAVEZ MARTINEZ, JOSELIN ALEXANDRA", "FIGUEROA MURO, LEONEL ARTURO", "GOMEZ CRIBILLERO, JOSE FELIPE", "PALOMINO SEGUÍN, AFRANIA", "LUZON CUEVA, BIANCA MARIETTE", "SUAÑA ZEGARRA, ADRIAN ANDRE", "SOTO POMACHAGUA, DORKAS YOMIRA JHERMY", "FIORENTINO MARTINEZ, LADY ALY", "LAMA MAVILA, HECTOR ANDRE", "MEZA HINOJO, GUSTAVO", "LOZADA MURILLO, PERSEO MARCELO", "ZAMBRANO JIMENEZ, MIGUEL ALONZO", "JACOBS LUQUE, NICOLAS", "VIDAL VIDAL, ROCIO GABRIELA", "TORRES ANICAMA, JANE CAMILA", "LOPEZ ESTRADA, MARIA ELISA", "BOYCO ORAMS, ALEJANDRO", "DIAZ BERROSPI, KARLINE ROSMELI", "RIEGA ESCALANTE, STEPHY ROSARIO", "LEVANO TORRES, VALERIA CECILIA", "ESQUIVES BRAVO, SEBASTIAN RENATO", "PEREZ GONZALES, JUAN CARLOS", "OTERO MAGUIÑA, MARIANA", "CLAVO CAMPOS, ANDREA BRIZETH", "AGUILAR GARCIA, ERICK JOSUE", "CALDAS VELASQUEZ, JOSUE DANIEL", "SALAS NUÑEZ BORJA, FABIO MANUEL", "PIZARRO VILLANES, FERNANDA NICOLLE", "QUILLATUPA MORALES, ANGELA ADELINA", "HUANCAYA IDONE, CESAR DANTE", "CALVO PORTOCARRERO, GABRIELA ISABEL", "IBAÑEZ ABANTO, ANGEL MAURICIO", "MELÉNDEZ APONTE, JUAN DIEGO", "CRISTIAN SERRANO, ARONE", "HINOJOSA CAHUANA, PERCY ALBERTH", "ANGLAS GARCÍA, KEVIN ARTURO", "ALDAVE ACOSTA, CESAR ERNESTO", "NÚÑEZ HUAMÁN, CÉSAR AGUSTO", "OBREGON HUAMAN, DIANA EDITH", "SOTO PACHERRES, RODRIGO FRANCO", "INGARUCA RIVERA, GRETTEL ALEXANDRA", "ROJAS HUAMAN, ROSA ANGELA", "NEYRA SALAS, DANTE OMAR", "HUERTA ESPINOZA, YAJAIRA ALEXANDRA", "HUANCA MARTINEZ, JORGE ALBERTO", "FLORES CADILLO, ALEXIS" ]
emails = ["cscornejo@pucp.edu.pe", "orellana.cn@pucp.edu.pe", "karina.morales@pucp.edu.pe", "a20083223@pucp.pe", "abel.camacho@pucp.pe", "mtintaya@pucp.edu.pe", "joselin.chavez@pucp.edu.pe", "a20105737@pucp.pe", "jfgomezc@pucp.pe", "afrania.palomino@pucp.pe", "luzon.bianca@pucp.pe", "adrian.suanaz@pucp.pe", "soto.y@pucp.edu.pe", "a20132766@pucp.pe", "andre.lama@pucp.edu.pe", "gustavo.meza@pucp.edu.pe", "pmlozada@pucp.edu.pe", "m.zambranoj@pucp.edu.pe", "nicolas.jacobs@pucp.edu.pe", "gvidal@pucp.edu.pe", "jane.torres@pucp.edu.pe", "m.lopez@pucp.edu.pe", "alejandro.boyco@pucp.edu.pe", "a20167070@pucp.edu.pe", "riega.stephy@pucp.edu.pe", "vlevanot@pucp.edu.pe", "sesquives@pucp.edu.pe", "perez.juanc@pucp.edu.pe", "mariana.otero@pucp.edu.pe", "aclavo@pucp.edu.pe", "a20182474@pucp.edu.pe", "josue.caldas@pucp.edu.pe", "fabio.salas@pucp.edu.pe", "fernanda.pizarro@pucp.edu.pe", "aquillatupa@pucp.pe", "", "", "", "", "", "f0873079@pucp.edu.pe", "", "", "", "", "", "", "", "", "", "", "flores.alexis@pucp.edu.pe", ]

1. Show the indices of the `np.nan` values  in the `f_list` list. We want to see this output: `The indices 0, 1, 4, 7 have np.nan values.` **Hint: Use print function and [f-strings](https://realpython.com/python-f-strings/) to insert the indices values.**

In the following list we try to get a list of booleans where True should appear in the positions where np.nan is found, and False should appear otherwise.

In [3]:
a=list(map(np.isnan,f_list)) 
# Let's remember that with the map function the function of the first arguments is applied to each element of the list introduced in the second argument.
# With np.isnan you get True when the element is np.nan, False otherwise.

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''

You can see that the previous line of code does not work. This is because np.isnan cannot be applied to string objects (and the list provided has these types of objects). To fix this problem we do the following:

We define the function `str0` which returns True when the element is not a string, False otherwise. Then we use the `map` function to apply the function made to each element of the `f_list` list.

In [4]:
def str0(x):
    y=type(x)!=str
    return y

a=list(map(str0,f_list))

print(a)

[True, True, False, False, True, False, False, True]

Note that the list obtained has True in the positions where there is np.nan and False where there is not. Since the list `f_list` only has two types of objects (strings and np.nan), the function created allows us to differentiate between np.nan and other elements. It wouldn't work if there were other types of items in the list.

Now we create the following np.array that contains exclusively the index position of the elements where True appears from the list obtained previously. This action is done precisely with `np.argwhere`.

In [5]:
b=np.argwhere(a)
print(b)

[[0]
 [1]
 [4]
 [7]]

Using the map and int function we convert each element of this array into an integer and save it in a new list.

In [6]:
b=list(map(int,b))
print(b)

[0, 1, 4, 7]

Now, using f-strings we print the text requested by the question.

In [7]:
print(f'The indices {", ".join(map(str, b))} have np.nan values.')

The indices 0, 1, 4, 7 have np.nan values.

Notice that inside the braces is placed `", ".join(map(str, b))`. Precisely, this command allows us to obtain a string in which each element b converted into a string (thanks to the `map` and `str` function) is combined into a single string in which each element is also separated by ", ". Therefore, the comeand returns in summary "0, 1, 4, 7".

2. Replicate 4 times the values of the list `p2_list`. We expect an ouput like this: `[2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5]`.  **Hint: Use multiplication function in `lists` and see the output.**

We can do this simply with the following lines of code:

In [8]:
p2_list_1= p2_list*4
print(p2_list_1)

[2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5]

Using list multiplication using `*4` can duplicate the provided list 4 times.

3. Print the length of `f_list`. **Hint: Length function**

We can do this simply with the following line of code:

In [9]:
print(len(f_list))

8

Where `len` is the length function which returns the number of elements in the list. And let's remember that with the `print` function we can print the result of the operation in the output.

4. Print `My teacher assistant is so boring.` using `text1` list. **Hint: Use the [`join` function](https://stackoverflow.com/questions/493819/why-is-it-string-joinlist-instead-of-list-joinstring)**

We can do this simply with the following line of code:

In [10]:
' '.join(text1)

'My teacher assistant is so boring.'

Remember that with the join method (which is applied to strings) we manage to obtain a single string that joins the elements contained in the list provided in the input (in this case `text1`) and these elements in turn are separated by the string called at the beginning, in this case being `" "`. This is why the printed result is obtained.

5. Print `My TA is so boring, but is very funny.` using `text1` list.**Hint: Use the `join` function, and `extend` method.**

First we extend the provided word list with the new words required for printing. For this we use the `extend` method.

In [11]:
text1.extend(['but', 'is', 'very', 'funny.'])

Finally, we use the `join` method again to create the required string. Additionally, we use the `replace` method to replace some parts of the string with others to obtain one equal to the one requested.

In [12]:
' '.join(text1).replace('g. ','g, ').replace('teacher assistant','TA')

'My TA is so boring, but is very funny.'

6. Print <br>
`The max value of values1 is 86 and is located in the 0 index. ` <br>
`The min value of values1 is 0 and is located in the 7 index. ` <br> **Hint: Use the `f-string`, `min`, and `max` functions.**
<br>

We define the following:

In [13]:
m_1=max(values1)
m_2=values1.index(m_1)

m_3=min(values1)
m_4=values1.index(m_3)

With the functions `max` and `min` we obtain the maximum and minimum value respectively within the list `values1`. Then with the `index` method we obtain the numerical position where these values are located.

With these values saved in `m_1`, `m_2`, `m_3` and `m_4` we print the required strings.

In [14]:
print(f'The max value of values1 is {m_1} and is located in the {m_2} index.')
print(f'The min value of values1 is {m_3} and is located in the {m_4} index.')

The max value of values1 is 86 and is located in the 0 index.
The min value of values1 is 0 and is located in the 7 index.

7. Get two lists: `names` and `last_names` using `last_and_name` list. **Hint: Use `map` and `split`.**

First we define the following function:

In [15]:
def split(x):
    y=x.split(',')
    return y

With this function a string would be separated into parts, where the separator element would be `,`.

We apply this function to each string element of `last_and_name` to separate first names from last names (which are conveniently strings divided by a comma).

In [16]:
last_and_name_1 = list(map(split,last_and_name))
print(last_and_name_1)

[['CORNEJO SANCHEZ', ' CHRISTIAN SANTOS'], ['ORELLANA QUISPE', ' CRISTIAN NASSER'], ['MORALES CHOQUEHUANCA', ' ANGELICA KARINA'], ['GUIMARAY RIBEYRO', ' JOSE ROBERTO'], ['CAMACHO GAVIDIA', ' ABEL FERNANDO'], ['TINTAYA ORIHUELA', ' MEIR ALVARO'], ['CHAVEZ MARTINEZ', ' JOSELIN ALEXANDRA'], ['FIGUEROA MURO', ' LEONEL ARTURO'], ['GOMEZ CRIBILLERO', ' JOSE FELIPE'], ['PALOMINO SEGUÍN', ' AFRANIA'], ['LUZON CUEVA', ' BIANCA MARIETTE'], ['SUAÑA ZEGARRA', ' ADRIAN ANDRE'], ['SOTO POMACHAGUA', ' DORKAS YOMIRA JHERMY'], ['FIORENTINO MARTINEZ', ' LADY ALY'], ['LAMA MAVILA', ' HECTOR ANDRE'], ['MEZA HINOJO', ' GUSTAVO'], ['LOZADA MURILLO', ' PERSEO MARCELO'], ['ZAMBRANO JIMENEZ', ' MIGUEL ALONZO'], ['JACOBS LUQUE', ' NICOLAS'], ['VIDAL VIDAL', ' ROCIO GABRIELA'], ['TORRES ANICAMA', ' JANE CAMILA'], ['LOPEZ ESTRADA', ' MARIA ELISA'], ['BOYCO ORAMS', ' ALEJANDRO'], ['DIAZ BERROSPI', ' KARLINE ROSMELI'], ['RIEGA ESCALANTE', ' STEPHY ROSARIO'], ['LEVANO TORRES', ' VALERIA CECILIA'], ['ESQUIVES BRAVO', ' SEBASTIAN RENATO'], ['PEREZ GONZALES', ' JUAN CARLOS'], ['OTERO MAGUIÑA', ' MARIANA'], ['CLAVO CAMPOS', ' ANDREA BRIZETH'], ['AGUILAR GARCIA', ' ERICK JOSUE'], ['CALDAS VELASQUEZ', ' JOSUE DANIEL'], ['SALAS NUÑEZ BORJA', ' FABIO MANUEL'], ['PIZARRO VILLANES', ' FERNANDA NICOLLE'], ['QUILLATUPA MORALES', ' ANGELA ADELINA'], ['HUANCAYA IDONE', ' CESAR DANTE'], ['CALVO PORTOCARRERO', ' GABRIELA ISABEL'], ['IBAÑEZ ABANTO', ' ANGEL MAURICIO'], ['MELÉNDEZ APONTE', ' JUAN DIEGO'], ['CRISTIAN SERRANO', ' ARONE'], ['HINOJOSA CAHUANA', ' PERCY ALBERTH'], ['ANGLAS GARCÍA', ' KEVIN ARTURO'], ['ALDAVE ACOSTA', ' CESAR ERNESTO'], ['NÚÑEZ HUAMÁN', ' CÉSAR AGUSTO'], ['OBREGON HUAMAN', ' DIANA EDITH'], ['SOTO PACHERRES', ' RODRIGO FRANCO'], ['INGARUCA RIVERA', ' GRETTEL ALEXANDRA'], ['ROJAS HUAMAN', ' ROSA ANGELA'], ['NEYRA SALAS', ' DANTE OMAR'], ['HUERTA ESPINOZA', ' YAJAIRA ALEXANDRA'], ['HUANCA MARTINEZ', ' JORGE ALBERTO'], ['FLORES CADILLO', ' ALEXIS']]

However, we still get a single list. To create the two lists requested, we create the following two functions:

In [17]:
def get_first(x):
    y=x[0]
    return y

def get_second(x):
    y=x[1]
    return y

The first function obtains the first element of the entered input. The second function obtains the second element of the entered input.

We conveniently apply these functions to each list within the obtained list using the `map` function to obtain the required lists.

In [18]:
names=list(map(get_second,last_and_name_1))    
last_names=list(map(get_first,last_and_name_1))     

print(names)

[' CHRISTIAN SANTOS', ' CRISTIAN NASSER', ' ANGELICA KARINA', ' JOSE ROBERTO', ' ABEL FERNANDO', ' MEIR ALVARO', ' JOSELIN ALEXANDRA', ' LEONEL ARTURO', ' JOSE FELIPE', ' AFRANIA', ' BIANCA MARIETTE', ' ADRIAN ANDRE', ' DORKAS YOMIRA JHERMY', ' LADY ALY', ' HECTOR ANDRE', ' GUSTAVO', ' PERSEO MARCELO', ' MIGUEL ALONZO', ' NICOLAS', ' ROCIO GABRIELA', ' JANE CAMILA', ' MARIA ELISA', ' ALEJANDRO', ' KARLINE ROSMELI', ' STEPHY ROSARIO', ' VALERIA CECILIA', ' SEBASTIAN RENATO', ' JUAN CARLOS', ' MARIANA', ' ANDREA BRIZETH', ' ERICK JOSUE', ' JOSUE DANIEL', ' FABIO MANUEL', ' FERNANDA NICOLLE', ' ANGELA ADELINA', ' CESAR DANTE', ' GABRIELA ISABEL', ' ANGEL MAURICIO', ' JUAN DIEGO', ' ARONE', ' PERCY ALBERTH', ' KEVIN ARTURO', ' CESAR ERNESTO', ' CÉSAR AGUSTO', ' DIANA EDITH', ' RODRIGO FRANCO', ' GRETTEL ALEXANDRA', ' ROSA ANGELA', ' DANTE OMAR', ' YAJAIRA ALEXANDRA', ' JORGE ALBERTO', ' ALEXIS']

You can see `names` only contains the first names.

In [19]:
print(last_names)

['CORNEJO SANCHEZ', 'ORELLANA QUISPE', 'MORALES CHOQUEHUANCA', 'GUIMARAY RIBEYRO', 'CAMACHO GAVIDIA', 'TINTAYA ORIHUELA', 'CHAVEZ MARTINEZ', 'FIGUEROA MURO', 'GOMEZ CRIBILLERO', 'PALOMINO SEGUÍN', 'LUZON CUEVA', 'SUAÑA ZEGARRA', 'SOTO POMACHAGUA', 'FIORENTINO MARTINEZ', 'LAMA MAVILA', 'MEZA HINOJO', 'LOZADA MURILLO', 'ZAMBRANO JIMENEZ', 'JACOBS LUQUE', 'VIDAL VIDAL', 'TORRES ANICAMA', 'LOPEZ ESTRADA', 'BOYCO ORAMS', 'DIAZ BERROSPI', 'RIEGA ESCALANTE', 'LEVANO TORRES', 'ESQUIVES BRAVO', 'PEREZ GONZALES', 'OTERO MAGUIÑA', 'CLAVO CAMPOS', 'AGUILAR GARCIA', 'CALDAS VELASQUEZ', 'SALAS NUÑEZ BORJA', 'PIZARRO VILLANES', 'QUILLATUPA MORALES', 'HUANCAYA IDONE', 'CALVO PORTOCARRERO', 'IBAÑEZ ABANTO', 'MELÉNDEZ APONTE', 'CRISTIAN SERRANO', 'HINOJOSA CAHUANA', 'ANGLAS GARCÍA', 'ALDAVE ACOSTA', 'NÚÑEZ HUAMÁN', 'OBREGON HUAMAN', 'SOTO PACHERRES', 'INGARUCA RIVERA', 'ROJAS HUAMAN', 'NEYRA SALAS', 'HUERTA ESPINOZA', 'HUANCA MARTINEZ', 'FLORES CADILLO']

You can see `last_names` only contains the last names.

8. Give only the last names of students who do not have email. Use the `emails` and `last_names` list. **Hint: Use `map` and `split`.**

We define the following function:

In [20]:
def without_email(x):
    y=x[0]==""
    return y

This function returns True when the first element of `x` is equal to `""`, False otherwise.

Now, with the `zip` function we join each last name with its respective email address in a tuple (it must be specified that `zip` joins into tuples each element of two lists that have the same numerical position or index). Then with the `filter` function we apply the `without_email` function to each created tuple. In this case `filter` will only keep those elements or tuples that have obtained True when applying the function introduced in the first argument. And let's remember that this function would only return True if the first element of the tuple (being the email) is equal to `""`. Therefore, with this command we identify the tuples of those students who do not have an email address.

Finally, to create the required list we collect the student's last name from the filtered tuples. For this we use the `map` function with which we apply the `get_second` function to each tuple (which we remember returns the second element of the entered input). In this way we collected the requested last names in the `last_names_without_email` list. With this we collect the last name contained in each tuple and then save it in the `last_names_without_email` list.

In [21]:
z=zip(emails,last_names)
students_without_email = filter(without_email,z)

last_names_without_email = list(map(get_second, students_without_email))

print(last_names_without_email)

['HUANCAYA IDONE', 'CALVO PORTOCARRERO', 'IBAÑEZ ABANTO', 'MELÉNDEZ APONTE', 'CRISTIAN SERRANO', 'ANGLAS GARCÍA', 'ALDAVE ACOSTA', 'NÚÑEZ HUAMÁN', 'OBREGON HUAMAN', 'SOTO PACHERRES', 'INGARUCA RIVERA', 'ROJAS HUAMAN', 'NEYRA SALAS', 'HUERTA ESPINOZA', 'HUANCA MARTINEZ']

#### Question 1.3 - Strings

Let the following data be provided by the problem:

In [22]:
str1 = 'I am                            too                                                        old'
emails = ["cscornejo@pucp.edu.pe", "orellana.cn@pucp.edu.pe", "karina.morales@pucp.edu.pe", "a20083223@pucp.pe", "abel.camacho@pucp.pe", "mtintaya@pucp.edu.pe", "joselin.chavez@pucp.edu.pe", "a20105737@pucp.pe", "jfgomezc@pucp.pe", "afrania.palomino@pucp.pe", "luzon.bianca@pucp.pe", "adrian.suanaz@pucp.pe", "soto.y@pucp.edu.pe", "a20132766@pucp.pe", "andre.lama@pucp.edu.pe", "gustavo.meza@pucp.edu.pe", "pmlozada@pucp.edu.pe", "m.zambranoj@pucp.edu.pe", "nicolas.jacobs@pucp.edu.pe", "gvidal@pucp.edu.pe", "jane.torres@pucp.edu.pe", "m.lopez@pucp.edu.pe", "alejandro.boyco@pucp.edu.pe", "a20167070@pucp.edu.pe", "riega.stephy@pucp.edu.pe", "vlevanot@pucp.edu.pe", "sesquives@pucp.edu.pe", "perez.juanc@pucp.edu.pe", "mariana.otero@pucp.edu.pe", "aclavo@pucp.edu.pe", "a20182474@pucp.edu.pe", "josue.caldas@pucp.edu.pe", "fabio.salas@pucp.edu.pe", "fernanda.pizarro@pucp.edu.pe", "aquillatupa@pucp.pe"]

1. Drop the duplicated blank spaces in `str1`. Do not use the regular expresions. Do not use the code shown in class. Explain your steps.**Hint: Use `split` method and `join` function.**

First we use the `split` function without specifying a specific separator.

In [23]:
str2=str1.split()
print(str2)

['I', 'am', 'too', 'old']

Let's remember that with the `split` method we can collect the elements of a string divided by a specified separator into a list. If no separator is specified, by default all whitespaces are considered to be separators (as mentioned here: https://realpython.com/python-f-strings/).

Now with the `join` function we create a single string in which each element is separated by only one whitespace.

In [24]:
" ".join(str2)

'I am too old'

2. Get the number of letters in the string .**Hint: Use `len`function.**

Using the `map` function we apply the `len` function to each string collected in string2 (which only contains the words with letters from the original string). Then with the `sum` function we add the sizes obtained from each string collected in the list `l0` and thus obtain the total number of letters of the original string.

In [25]:
l0=list(map(len,str2))

letters=sum(l0)
print(letters)

9

3. Get the number of blank spaces (all of them) in the string .**Hint: Use `len`function.**

In this case we obtain the total number of strings contained in the original string using the `len` function on `str1`. Then we subtract this number from the number of letters found (or strings that are not whitespaces) and in this simple way we would obtain the total number of whitespaces of the original string.

In [26]:
n0=len(str1)
n1=n0-letters
print(n1)

85

4. Get the position of `@` in each string in the emails list. **Hint: Use `map`function and `find` method.**

We define the function `position1` which returns the position of `@` of a given string. Then with the map function we apply this function to each string contained in the `emails` list. And by applying the `list` function we would collect the positions found for each string in a list.

In [27]:
def position1(x):
    y=x.find('@')
    return y

l1=list(map(position1,emails))
print(l1)

[9, 11, 14, 9, 12, 8, 14, 9, 8, 16, 12, 13, 6, 9, 10, 12, 8, 11, 14, 6, 11, 7, 15, 9, 12, 8, 9, 11, 13, 6, 9, 12, 11, 16, 11]

5. Identifies if exists `.edu.`  in each string in the `emails` list. Get a list of Booleans. **Hint: Use `map` function and `find` method.**

We define the function `position2` which returns True if `.edu` exists within the given string, False otherwise. Greater detail of its configuration is presented in the code.

In [28]:
def position2(x):
    y=x.find('.edu.') # With this is the position of '.edu'. If not found, then -1 is returned.
    z=y==-1 # z will be true if y is equal to -1, it will be false otherwise.
    return z 
# Therefore, if ".edu" is not found in the provided string, the function will return True. It will return False otherwise.

We apply the created function to each string of `emails` using the `map` function. In this way, the required list of booleans is obtained, which is True in the positions where the email does have `.edu`, and is False in the positions where the opposite is true.

In [29]:
l2=list(map(position2,emails))

6. Get all the strings before the first dot `.` in each string in the `emails` list. Identifies how many of them has `@`. **Hint: Use `map` function and `find` method.**

We create the function `dot1` which collects all the strings before the first dot. We then apply this function to each `emails`'s string using the `map` function to obtain the required strings.

In [30]:
def dot1(x):
    y=x[0:x.find('.')] # x.find('.') It will be equal to the number of the position where the first dot is located. In this way all the strings are obtained up to the first dot found.
    return y

l4=list(map(dot1,emails))
print(l4)

['cscornejo@pucp', 'orellana', 'karina', 'a20083223@pucp', 'abel', 'mtintaya@pucp', 'joselin', 'a20105737@pucp', 'jfgomezc@pucp', 'afrania', 'luzon', 'adrian', 'soto', 'a20132766@pucp', 'andre', 'gustavo', 'pmlozada@pucp', 'm', 'nicolas', 'gvidal@pucp', 'jane', 'm', 'alejandro', 'a20167070@pucp', 'riega', 'vlevanot@pucp', 'sesquives@pucp', 'perez', 'mariana', 'aclavo@pucp', 'a20182474@pucp', 'josue', 'fabio', 'fernanda', 'aquillatupa@pucp']

Now the function `dot2` is defined, which returns True if `@` is found in the provided string, False otherwise. Greater detail of its configuration is specified in the lines of code.

Then with the `map` function we apply the `dot2` function to each of the strings obtained previously. In this way we obtain a list of booleans that have True in the positions where `@` was found in the provided string, False otherwise.

In [31]:
def dot2(x):
    y=x.find('@') # With this y is equal to the position where '@' is located. Returns -1 if '@' is not found.
    z=y!=-1 # With this z is True if and not equal to -1, False otherwise.
    return z

# So z will be True as long as '@' has been found since y is different from -1.

l5=list(map(dot2,l4))
print(l5)

[True, False, False, True, False, True, False, True, True, False, False, False, False, True, False, False, True, False, False, True, False, False, False, True, False, True, True, False, False, True, True, False, False, False, True]

Now, we add all the elements of the found boolean list using the `sum` function. Let's remember that True elements are equal to 1 and False elements are equal to 0. So, adding everything together would give us the total number of strings that contain `@` up to before the first dot.

In [32]:
n2=sum(l5)
print(n2)

14

#### Question 1.4 - Pandas

1. Load Data:
   Load the financial data available at this URL:    https://raw.githubusercontent.com/datasets/finance-vix/main/data/vix-daily.csv
   Use `pd.read_csv()` and the link to load the data into a DataFrame.
   
We can do this simply with the following line of code.

In [33]:
df=pd.read_csv(r'https://raw.githubusercontent.com/datasets/finance-vix/main/data/vix-daily.csv')

It can be seen that the imported DataFrame is the following:

In [34]:
df

            DATE   OPEN   HIGH    LOW  CLOSE
0     01/02/1990  17.24  17.24  17.24  17.24
1     01/03/1990  18.19  18.19  18.19  18.19
2     01/04/1990  19.22  19.22  19.22  19.22
3     01/05/1990  20.11  20.11  20.11  20.11
4     01/08/1990  20.26  20.26  20.26  20.26
...          ...    ...    ...    ...    ...
8572  12/29/2023  12.55  13.19  12.36  12.45
8573  01/02/2024  13.22  14.23  13.10  13.20
8574  01/03/2024  13.35  14.22  13.33  14.04
8575  01/04/2024  13.93  14.20  13.64  14.13
8576  01/05/2024  14.24  14.58  13.29  13.35

[8577 rows x 5 columns]

2. Explore Data:
   a) Display the first five rows of the DataFrame.
   b) Display the summary statistics of the DataFrame.

To display only the first five rows of the DataFrame we use the `head` method as follows:

In [35]:
df.head(5)

         DATE   OPEN   HIGH    LOW  CLOSE
0  01/02/1990  17.24  17.24  17.24  17.24
1  01/03/1990  18.19  18.19  18.19  18.19
2  01/04/1990  19.22  19.22  19.22  19.22
3  01/05/1990  20.11  20.11  20.11  20.11
4  01/08/1990  20.26  20.26  20.26  20.26

To display a statistical summary we use the `describe` method as follows:

In [36]:
df.describe()

              OPEN         HIGH          LOW        CLOSE
count  8577.000000  8577.000000  8577.000000  8577.000000
mean     19.666454    20.474364    18.914884    19.580374
std       7.979066     8.439927     7.469827     7.906214
min       9.010000     9.310000     8.560000     9.140000
25%      13.940000    14.540000    13.400000    13.880000
50%      17.790000    18.470000    17.220000    17.760000
75%      23.100000    23.960000    22.320000    22.990000
max      82.690000    89.530000    72.760000    82.690000

3. Add Columns:
   a) Add a new column 'Level' that categorizes the 'Close' column values into 'Low' (< 20), 'Medium' (20-30), and 'High' (>30). You need to make a filter to make this categorization. You can see below some suggestions how to do it.
   b) Add a new column 'Year' extracted from the 'Date' column. You need to work with dates. You can do it directly workiwith the column splitting it or changing it to date format an dfollowing the below suggestion. 
   
We can use `pd.cut` as follows:

In [37]:
bins = [0, 20, 30, float('inf')]
labels = ['Low', 'Medium', 'High']

df['LEVEL']=pd.cut(df['CLOSE'],bins=bins,labels=labels)

The breakpoints of the classifier interval are specified in the `bins` list. The first interval is from 0 to 20, the second is from 20 to 30, and the last is from 30 onwards. The values of `df['CLOSE']` that are in the first interval will be classified within it and the same happens with the other values in other intervals. Finally, `Low` will be placed as a label if the observation was placed in the first interval, `Medium` if the observation was placed in the second interval, and `High` if the observation was placed in the last interval. This creates the required column called `LEVEL` (which is created using `df['LEVEL']=`). You can see it created in the following line:

In [38]:
df

            DATE   OPEN   HIGH    LOW  CLOSE   LEVEL
0     01/02/1990  17.24  17.24  17.24  17.24     Low
1     01/03/1990  18.19  18.19  18.19  18.19     Low
2     01/04/1990  19.22  19.22  19.22  19.22     Low
3     01/05/1990  20.11  20.11  20.11  20.11  Medium
4     01/08/1990  20.26  20.26  20.26  20.26  Medium
...          ...    ...    ...    ...    ...     ...
8572  12/29/2023  12.55  13.19  12.36  12.45     Low
8573  01/02/2024  13.22  14.23  13.10  13.20     Low
8574  01/03/2024  13.35  14.22  13.33  14.04     Low
8575  01/04/2024  13.93  14.20  13.64  14.13     Low
8576  01/05/2024  14.24  14.58  13.29  13.35     Low

[8577 rows x 6 columns]

Now, to create the requested year column, we first obtain a series in datetime format with the following command:

In [39]:
serie1=pd.to_datetime(df['DATE'])

Series1 contains in datetime format the string dates contained in `df['DATE']`

Now we extract the year from each date with `dt.year`

In [40]:
serie2=serie1.dt.year

And finally we create the required column using the years obtained.

In [41]:
df['YEAR']=serie2

4. Add Rows:
   a) Add a new row with a date of your choice and fill the other columns with appropriate values. 

First we look at the end of the DataFrame:

In [42]:
df.tail()

            DATE   OPEN   HIGH    LOW  CLOSE LEVEL  YEAR
8572  12/29/2023  12.55  13.19  12.36  12.45   Low  2023
8573  01/02/2024  13.22  14.23  13.10  13.20   Low  2024
8574  01/03/2024  13.35  14.22  13.33  14.04   Low  2024
8575  01/04/2024  13.93  14.20  13.64  14.13   Low  2024
8576  01/05/2024  14.24  14.58  13.29  13.35   Low  2024

We then create the following dictionary using values close to the last observation.

In [43]:
t=pd.Series(pd.to_datetime('01/06/2024')).dt.year # With this we extract the year from the date that we assign to this observation that we want to add.

r={'DATE':'01/06/2024','OPEN':[14],'HIGH':[14.5],'LOW':[13.5],'CLOSE':[13.9],'LEVEL':'Low','YEAR':np.float64(t)}

We use the dictionary to create the DataFrame of the new observation. Likewise, we apply an appropriate index.

In [44]:
new_row=pd.DataFrame(r,index=['8576'])

Now we add the observation contained in the previous DataFrame using the `append` method:

In [45]:
df=df.append(new_row)

We see that the observation was added.

In [46]:
df.tail()

            DATE   OPEN   HIGH    LOW  CLOSE LEVEL    YEAR
8573  01/02/2024  13.22  14.23  13.10  13.20   Low  2024.0
8574  01/03/2024  13.35  14.22  13.33  14.04   Low  2024.0
8575  01/04/2024  13.93  14.20  13.64  14.13   Low  2024.0
8576  01/05/2024  14.24  14.58  13.29  13.35   Low  2024.0
8576  01/06/2024  14.00  14.50  13.50  13.90   Low  2024.0

5. Analysis:
   a) Calculate the average of the column 'Close' for each 'Year'. You need to group for this task.
   b) Count the number of 'High', 'Medium', and 'Low'  Level days in the data.
   
With the `groupby` method we join the observations under the same year (introducing `['YEAR']` as an argument) and with the `mean` method we calculate the mean per year (only for the `CLOSE` column, which is achieved specifying `['CLOSE']`). In the following lines of code we do this:

In [47]:
avg1=df.groupby(['YEAR'])
avg1['CLOSE'].mean()

YEAR
1990.0    23.063478
1991.0    18.373373
1992.0    15.452047
1993.0    12.686245
1994.0    13.925516
1995.0    12.388770
1996.0    16.442165
1997.0    22.363984
1998.0    25.602976
1999.0    24.371912
2000.0    23.315000
2001.0    25.749677
2002.0    27.292460
2003.0    21.982857
2004.0    15.479644
2005.0    12.807063
2006.0    12.810320
2007.0    17.535936
2008.0    32.695534
2009.0    31.479008
2010.0    22.548889
2011.0    24.202579
2012.0    17.801640
2013.0    14.230119
2014.0    14.175992
2015.0    16.674087
2016.0    15.825635
2017.0    11.090239
2018.0    16.639841
2019.0    15.387540
2020.0    29.251304
2021.0    19.656151
2022.0    25.637148
2023.0    16.849027
2024.0    13.724000
Name: CLOSE, dtype: float64

Remember that we are only showing the average values that 'CLOSE' obtained for each year.

Now, to count the number of `high`, `medium` and `low` level days in the data we do the following:

We create a column of ones called N:

In [48]:
df['N']=1

Now we group according to `LEVEL` with the `groupby` method. Then with the `sum` method we obtain the total of ones for each `LEVEL`. Note that each one represents a day, so the sum represents the total number of days for each `LEVEL`

In [49]:
avg2=df.groupby(['LEVEL'])
avg2['N'].sum()

LEVEL
High       720
Low       5276
Medium    2582
Name: N, dtype: int64